РП/src/InformationRegisters/ПараметрыОпределенияОбычныхЦенКонтролируемыхОпераций/ПараметрыОпределенияОбычныхЦенКонтролируемыхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыОпределенияОбычныхЦенКонтролируемыхОпераций</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КодОснования</name>
    <comment>Додаток 6 порядку складання звіту про контрольовані операції - 201-206</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодМетода</name>
    <comment>Додаток 7 порядку складання звіту про контрольовані операції - 301-306</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодИсточника</name>
    <comment>Додаток 8 порядку складання звіту про контрольовані операції - 401-409</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИсследуемаяСторона</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/InformationRegisters/ПараметрыОпределенияОбычныхЦенКонтролируемыхОпераций/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокКодовОснования = КонтролируемыеОперацииПовтИсп.ПолучитьСписокВыбораКодыОснования();
	Для каждого ЭлементСпискаКодовОснования Из СписокКодовОснования Цикл
		Элементы.КодОснования.СписокВыбора.Добавить(ЭлементСпискаКодовОснования.Значение, ЭлементСпискаКодовОснования.Представление);
	КонецЦикла;

	СписокКодовИсточника = КонтролируемыеОперацииПовтИсп.ПолучитьСписокВыбораКодыИсточника();
	Для каждого ЭлементСпискаКодовИсточника Из СписокКодовИсточника Цикл
		Элементы.КодИсточника.СписокВыбора.Добавить(ЭлементСпискаКодовИсточника.Значение, ЭлементСпискаКодовИсточника.Представление);
	КонецЦикла;
	
	СписокКодовМетода = КонтролируемыеОперацииПовтИсп.ПолучитьСписокВыбораКодыМетода();
	Для каждого ЭлементСпискаКодовМетода Из СписокКодовМетода Цикл
		Элементы.КодМетода.СписокВыбора.Добавить(ЭлементСпискаКодовМетода.Значение, ЭлементСпискаКодовМетода.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьИсследуемойСтороны();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьИсследуемойСтороны()
	Элементы.ИсследуемаяСторона.Видимость = НЕ Запись.КодМетода = "301" И НЕ Запись.КодМетода = "305";
КонецПроцедуры

&НаКлиенте
Процедура КодМетодаПриИзменении(Элемент)
	УстановитьВидимостьИсследуемойСтороны();
КонецПроцедуры
